[
    {
        "title": "Exploiter une base de données",
        "date": "2023",
        "tags" : ["PostgreSQL", "R Markdown", "Matplotlib", "2 personnes"],
        "description": "Étudier les accidents de la route des moins de 18 ans en Provence-Alpes-Côte d'Azur.",
        "features": [
            "Importer les données dans une base de données",
            "Trier et nettoyer la base de données",
            "Faire des requêtes sur la base",
            "Réaliser un rapport en anglais"
        ],
        "detailDescription": "À l'aide d'une base de données mise à notre disposition par l'Observatoire National Interministériel de la Sécurité Routière, nous avons réalisé une étude sur les accidents en Provence-Alpes-Côte d'Azur au cours des quinze dernières années, en se focalisant sur la population de moins de 18 ans. <br/> L'objectif de cette étude est d'informer les usagers de la route.\nNous avons d'abord nettoyé les données pour ensuite les triés et garder que les informations importante pour notre étude, par la suite nous avons étudié cette base de donnée à l'aide de requête SQL, pour au final\n créer un document en anglais qui regroupe plusieurs graphiques et tableaux présentant les résultats de cette étude à l'aide du logiciel R studio avec le langage R markdown afin de régider un rapport écrit et de rajouter des graphes et tableaux dans un document pdf."
    },
    {
        "title": "Ezlan",
        "date": "2023",
        "tags" : ["Java", "JavaFX", "Git", "5 personnes (Chef de projet)"],
        "description": "Développer une application de gestion de tournoi de jeux vidéo",
        "features": [
            "Planifier les tâches des membres",
            "Définir les spécifications de l'application",
            "Travailler en équipe",
            "Coder, tester, debugger l'application"
        ],
    "detailDescription": "Ce projet visait à développer une application de gestion de tournoi de jeux vidéo en utilisant Java et JavaFX et en respectant l'architecture MVC (Modèle-Vue-Contrôleur). En tant que chef de projet, avec l'équipe nous avons coordonné la planification des tâches et réparti les rôles. Ensemble, nous avons défini les spécifications de l'application, détaillant les fonctionnalités nécessaires pour répondre aux besoins des utilisateurs. <br/> Tout au long du projet, nous avons codé, testé et débogué l'application, garantissant ainsi son bon fonctionnement et son efficacité. Pour ma part, j'ai participé au développement côté back-end, avec la création des contrôleurs et modèles. L'utilisation de Git a facilité notre gestion de version et notre collaboration. Cette expérience m'a permis de développer des compétences en gestion de projet, en travail d'équipe et en développement logiciel."
    },
    {
        "title": "Installation de services réseau",
        "date": "2023",
        "tags" : ["Debian 11", "Apache", "PostgreSQL", "PHP", "1 personne"],
        "description": "Installer serveur Debian 11 équipé d'Apache, PostgreSQL et PHP sur une VM",
        "features": [
            "Réaliser un guide d'installation rédigé en anglais",
            "Installer et configurer les différents services"
        ],
        "detailDescription":"test"
    },
    {
        "title": "CodeCrafter",
        "date": "2023",
        "tags" : ["JS", "React", "Node JS", "Phaser JS", "PostgreSQL", "7 personnes", "Chef de projet"],
        "description": "Développer un coding game destiné aux élèves de NSI sur l'algorithmique en 3 mois",
        "features": [
            "Définir les spécifications de l'application",
            "Planifier le projet et les tâches des membres",
            "Développer le modèle de donnée",
            "Interagir avec une base de données",
            "Coder, tester, debugger le coding game"
        ],
        "detailDescription": "À l'aide d'une base de données mise à notre disposition par l'Observatoire National Interministériel de la Sécurité Routière, nous avons réalisé une étude sur les accidents en Provence-Alpes-Côte d'Azur au cours des quinze dernières années, en se focalisant sur la population de moins de 18 ans. L'objectif de cette étude est d'informer les usagers de la route. Nous avons d'abord nettoyé les données pour ensuite les triés et garder que les informations importante pour notre étude, par la suite nous avons étudié cette base de donnée à l'aide de requête SQL, pour au final créer un document en anglais qui regroupe plusieurs graphiques et tableaux présentant les résultats de cette étude à l'aide du logiciel R studio avec le langage R markdown afin de régider un rapport écrit et de rajouter des graphes et tableaux dans un document pdf."
    },
    {
        "title": "Développement d'une application web",
        "date": "2023",
        "tags" : ["Python", "Flask", "PostgreSQL", "2 personnes"],
        "description": "Développer une application web de gestion de projet",
        "features": [
            "Définir les spécifications de l'application",
            "Développer le modèle de donnée",
            "Interagir avec une base de données",
            "Coder, tester, debugger l'application"
        ],
        "detailDescription":"test"
    },
    {
        "title": "WhileTrue",
        "date": "2024",
        "tags" : ["Python", "GameJam", "Pygame/PyTMX", "5 personnes"],
        "description": "Réaliser un jeu avec des contraintes et langage imposé lors d'une GameJam",
        "features": [
            "Utiliser une bibliothèque de développement (Pygame, PyTMX)",
            "Développer une API",
            "Travailler en équipe"
        ],
        "detailDescription":"test"
    }
]
